**FREE

Dcl-Pi FAK101;
  pName     Char(20);
  pNum      Int(10) DIm(3);
End-Pi;

pName   = 'Hello ' + %Trim(pName);
pNum(3) = pNum(1) * pNum(2);

Return;