**FREE

Dcl-Pi FAK100;
  pName     Char(20);
  pNum1     Int(10);
  pNum2     Int(10);
  pResult   Int(10);
End-Pi;

pName   = 'Hello ' + %Trim(pName);
pResult = pNum1 * pNum2;

Return;